# Домашнее задание 2 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [29]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [31]:
import zipfile
import os

def extract_zip():
    zip_file = zipfile.ZipFile('Data.zip')
    zip_file.extractall()
    zip_file.close()
    all_files = os.listdir('Data')
    return(all_files)

def create_frame():
    info_temp = []
    mark_temp = []
    i = 0
    all_files = extract_zip()
    for file in all_files:
        if "info" in file:
            info_temp.append(file)
        else:
            mark_temp.append(file)
        i+=1
    df_1 = pd.read_csv(f'Data/{info_temp[0]}')
    for i in info_temp[1:]:
        temp = pd.read_csv(f'Data/{i}')
        df_1 = pd.concat([df_1, temp])
    df_2 = pd.read_csv(f'Data/{mark_temp[0]}')
    for i in mark_temp[1:]:
        temp = pd.read_csv(f'Data/{i}')
        df_2 = pd.concat([df_2, temp])
    df_main = pd.merge(df_1, df_2)
    return df_main

df_main = create_frame()
df_main

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,4,male,group C,some college,standard,none,group1,76,78,75
...,...,...,...,...,...,...,...,...,...,...
995,995,female,group E,master's degree,standard,completed,group10,88,99,95
996,996,male,group C,high school,free/reduced,none,group10,62,55,55
997,997,female,group C,high school,free/reduced,completed,group10,59,71,65
998,998,female,group D,some college,standard,completed,group10,68,78,77
999,999,female,group D,some college,free/reduced,none,group10,77,86,86

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [32]:
df_main = df_main.drop('index', 1)
df_main.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [33]:
df_main.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [34]:
df_main.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [35]:
#for i in df.isnull():
#    a = 0
#    a+=df.isnull()[i].sum()
#if (a > 0):
#    print("в таблице пропущенные значения")
#else:
#    print("в таблице нет пропущенные значения")

if df_main.isna().sum().sum() > 0:
    print('Да, есть')
else:
    print('Нет')

Нет

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [36]:
df_main.mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [39]:
df_main.groupby(['test preparation course']).mean()

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [42]:
df_main['lunch'].unique()

array(['standard', 'free/reduced'], dtype=object)

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [47]:
df_main.rename(columns={'parental level of education':'education', 'test preparation course':'test preparation'}, inplace=True)
df_main.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75

**Зафиксируем минимальный балл для сдачи экзамена**

In [60]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [76]:
#1
print(len(df_main[df_main['math score'] >= passmark])/len(df_main))

#2
print (len(df_main[(df_main['math score'] >= passmark) & (df_main['test preparation'] == 'completed')]) / len(df_main[df_main['math score'] >= passmark]))

#3
print (len(df_main[(df_main['math score'] < passmark) & (df_main['test preparation'] == 'none') & (df_main['gender'] == 'female')]) / len(df_main[df_main['gender'] == 'female']))

0.865
0.3815028901734104
0.13513513513513514

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [137]:
%%time
#1
df_main[["race/ethnicity" ,"reading score"]].groupby("race/ethnicity").mean()

Wall time: 9.93 ms

                reading score
race/ethnicity
group A             64.674157
group B             67.352632
group C             69.103448
group D             70.030534
group E             73.028571

In [136]:
%%time
#2
df_main[["education" ,"writing score"]].groupby("education").min()

Wall time: 22 ms

                    writing score
education
associate's degree             35
bachelor's degree              38
high school                    15
master's degree                46
some college                   19
some high school               10

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [139]:
%%time
#уважаемый ассист, обрати внимание пж, что столбцы перемешаны в финальном df'е <3
temp = {}
count = df_main["race/ethnicity"].value_counts().to_dict()
for i in df_main["race/ethnicity"].unique():
    temp[i] = 0
for index, row in df_main.iterrows():
    for i in temp:
        if (row["race/ethnicity"] == i):
            temp[i] += row["reading score"]
for i  in temp:
    temp[i] = temp[i] / count[i]
pd.DataFrame([temp])

Wall time: 152 ms

     group B    group C    group A    group D    group E
0  67.352632  69.103448  64.674157  70.030534  73.028571

In [155]:
%%time
#Для каждого уровня образования выведите минимальный балл за экзамен по письму
temp = {}
#count = df_main["education"].value_counts().to_dict()
for i in df_main["education"].unique():
    temp[i] = df_main["writing score"].max()
for index, row in df_main.iterrows():
    for i in temp:
        if (row["education"] == i):
            if (temp[i] > row["writing score"]):
                temp[i] = row["writing score"]
pd.DataFrame([temp])

Wall time: 153 ms

,bachelor's degree,some college,master's degree,associate's degree,high school,some high school
0,38,19,46,35,15,10

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [167]:
pd.pivot_table(data=df_main,index=['gender', 'education'])

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [264]:
def result_checker_m(row):
    if row["math score"] < passmark:
        return 'F'
    return 'P'

def result_checker_r(row):
    if row["reading score"] < passmark:
        return 'F'
    return 'P'

def result_checker_w(row):
    if row["writing score"] < passmark:
        return 'F'
    return 'P'

def create_new_cols():
    df_main['Math_PassStatus'] = df_main.apply(lambda row: result_checker_m(row), axis=1)
    df_main['Reading_PassStatus'] = df_main.apply(lambda row: result_checker_r(row), axis=1)
    df_main['Writing_PassStatus'] = df_main.apply(lambda row: result_checker_w(row), axis=1)
    
def count_f():
    print('Number of student failed math:' + str(len(df_main[df_main["Math_PassStatus"] == 'F'])))
    print('Number of student failed reading:' + str(len(df_main[df_main["Reading_PassStatus"] == 'F'])))
    print('Number of student failed writing:' + str(len(df_main[df_main["Writing_PassStatus"] == 'F'])))
    
create_new_cols()
count_f()

Number of student failed math:135
Number of student failed reading:90
Number of student failed writing:114

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [265]:
def result_checker(row):
    if ((row["math score"] < passmark) or (row["reading score"] < passmark) or (row["writing score"] < passmark)):
        return 'F'
    return 'P'

def create_new_col():
    df_main['OverAll_PassStatus'] = df_main.apply(lambda row: result_checker(row), axis=1)

def count_success():
    print('Number of student succeed all exams:' + str(len(df_main[df_main['OverAll_PassStatus'] == 'P'])))
    
create_new_col()
count_success()
#df.head()

Number of student succeed all exams:812

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [284]:
def GetGrade(avg_score):
    if avg_score >= 90:
        return 'A'
    elif avg_score >= 80 and avg_score < 90:
        return 'B'
    elif avg_score >= 70 and avg_score < 80:
        return 'C'
    elif avg_score >= 60 and avg_score < 70:
        return 'D'
    elif avg_score >= 50 and avg_score < 60:
        return 'E'
    else:
        return 'F'

df_main['Grade'] = df_main.mean(1)
df_main['Grade'] = df_main['Grade'].apply(GetGrade)
df_main[["education" ,"Grade"]].groupby(['Grade']).count()

       education
Grade
A             52
B            146
C            261
D            256
E            182
F            103